app/controllers/bookmarks_controller.rb

  def index
    @bookmarks = current_user.bookmarks.all
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]

  def create
    @bookmark = current_user.bookmarks.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save
---
INSERT INTO "bookmarks" ("created_at", "name", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Mar 2014 01:10:41 UTC +00:00], ["name", "test bookmark"], ["updated_at", Tue, 11 Mar 2014 01:10:41 UTC +00:00], ["url", "http://www.hello.com"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @bookmark.update(bookmark_params)
---
UPDATE "bookmarks" SET "title" = ?, "updated_at" = ? WHERE "bookmarks"."id" = 1  [["title", "hello1"], ["updated_at", Sun, 02 Mar 2014 21:11:46 UTC +00:00]]

  def destroy
    @bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 3]]

    def set_bookmark
      unless @bookmark = current_user.bookmarks.where(id: params[:id]).first
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."id" = 111 ORDER BY "bookmarks"."id" ASC LIMIT 1  [["user_id", 1]]